## DataFrame
### 생성

In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
'''
DataFrame은 2차원 배열 형식
테이블 형식

DataFrame은 다양한 방법으로 생성
1) 리스트 값을 딕셔녀리로 사용
2) Numpy 배열을 이용
3) 파일업로드

'''

'\nDataFrame은 2차원 배열 형식\n테이블 형식\n\nDataFrame은 다양한 방법으로 생성\n1) 리스트 값을 딕셔녀리로 사용\n2) Numpy 배열을 이용\n3) 파일업로드\n\n'

In [3]:
'''
DataFrame 구조
1) col = Series
Series 는 동일한 자료형
DF는 다양한 Series
- 각 시리즈를 따로 부를 수 있다
'''

'\nDataFrame 구조\n1) col = Series\nSeries 는 동일한 자료형\nDF는 다양한 Series\n- 각 시리즈를 따로 부를 수 있다\n'

In [4]:
# 1-1 딕셔너리 이용해서 DataFrame 형성
list_dic={'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
          'year':[2000,2001,2002,2001,2002,2003],
          'pop':[1.5,1.7,3.6,2.4,2.9,3.2]
        }
listDf=DataFrame(list_dic)

# DataFrame 구조
# df.colName or df['colName']= 해당 자료만 가져옴

print(listDf)
print('*'*30)
print(listDf.state)
print('*'*30)
print(listDf.year)
print('*'*30)
# 단, 내장함수랑 같은 이름일 경우, 컬럼을 제대로 지정
print(listDf['pop'])
# Series임을 알 수 있다
print(type(listDf['pop']))
print('*'*30)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
******************************
0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object
******************************
0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64
******************************
0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64
<class 'pandas.core.series.Series'>
******************************

In [5]:
data1={
    'name':['James','Peter','Tomas','Robert'],
    'address':['NY','NY','LA','TEXAS'],
    'age':[33,44,55,66]
}
df1=DataFrame(data1)
df1

     name address  age
0   James      NY   33
1   Peter      NY   44
2   Tomas      LA   55
3  Robert   TEXAS   66

In [6]:
# 1-2. Numpy배열 활용하여 생성 :: array, random
# 부가 속성으로 index와 column 라벨링 가능
np.random.seed(0)

df2 = DataFrame(
    np.random.randint(10,100,16).reshape(4,4),
    columns=list('ABCD'),
    index=list('1234')
)
# 컬럼명 수정하기
df2.columns=['one','two','three','four']
df2

   one  two  three  four
1   54   57     74    77
2   77   19     93    31
3   46   97     80    98
4   98   22     68    75

In [7]:
# 1-3. 파일 사용... read_csv()
'''
csv = Comma Seperated Value
csv 파일 포맷은 데이터 값이 쉼표로 구분되는 텍스트 파일

누락데이터가 어디에 들어있는지 휘리릭 확인해야 함
'''
df3= pd.read_csv('../data/tips.csv')
df3

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner   2.0
1         10.34  1.66    Male     No   Sun  Dinner   3.0
2         21.01  3.50    Male     No   Sun  Dinner   3.0
3         23.68  3.31    Male     No   Sun  Dinner   2.0
4         24.59  3.61  Female     No   Sun  Dinner   4.0
..          ...   ...     ...    ...   ...     ...   ...
240       27.18  2.00  Female    Yes   Sat  Dinner   2.0
241       22.67  2.00    Male    Yes   Sat  Dinner   2.0
242       17.82  1.75    Male     No   Sat  Dinner   2.0
243       18.78  3.00  Female     No  Thur  Dinner   2.0
244       25.34   NaN     NaN    NaN   NaN     NaN   NaN

[245 rows x 7 columns]

### DataFrame 구조 확인

In [8]:
'''
다음 확인하는 속성
index, values, colums, dtypes

컬럼에 대한 전체적으로 확인하는 함수 : info()
'''
print(df3.index)
print(df3.columns)
print(df3.values)
print(df3.dtypes)
print('*'*30)
df3.info()

RangeIndex(start=0, stop=245, step=1)
Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')
[[16.99 1.01 'Female' ... 'Sun' 'Dinner' 2.0]
 [10.34 1.66 'Male' ... 'Sun' 'Dinner' 3.0]
 [21.01 3.5 'Male' ... 'Sun' 'Dinner' 3.0]
 ...
 [17.82 1.75 'Male' ... 'Sat' 'Dinner' 2.0]
 [18.78 3.0 'Female' ... 'Thur' 'Dinner' 2.0]
 [25.34 nan nan ... nan nan nan]]
total_bill    float64
tip           float64
sex            object
smoker         object
day            object
time           object
size          float64
dtype: object
******************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 245 entries, 0 to 244
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  245 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    float64
dtypes: float64(3), object(4)
memory usage: 13.5+ KB

In [9]:
# head(idx) : 가장 많이 사용되는 조회함수
# 앞에서부터 조회
# idx 없으면 5개 보여줌
df3.head()

# tail() : 뒤에서
df3.tail()

# info() : 컬럼에 대한 상세정보 조회
df3.info()

# shape : 행렬 형태 조회... 튜플
df3.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 245 entries, 0 to 244
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  245 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    float64
dtypes: float64(3), object(4)
memory usage: 13.5+ KB

(245, 7)

### DataFrame - 컬럼명 변경 및 추가

In [10]:
# 1. 컬럼명 변경
'''
전부 변경 : .columns =  []

부분 변경 : rename
'''
# 1-1 : 전체 변경
df2.columns=['A-Class','B-Class','C-Class','D-Class']
df2

   A-Class  B-Class  C-Class  D-Class
1       54       57       74       77
2       77       19       93       31
3       46       97       80       98
4       98       22       68       75

In [11]:
# 1-2 부분 변경
# map방식, 
# 원본이 안 바뀜... columns와 차이
# 원본 바뀌게하는 옵션 부여... inplace

df1.rename(columns={'address':'addr'},inplace=True)
df1

     name   addr  age
0   James     NY   33
1   Peter     NY   44
2   Tomas     LA   55
3  Robert  TEXAS   66

In [12]:
# 2. 컬럼 추가
'''
- 컬럼 지정법 ['']
- 지정한 컬럼에 값할당
- 누락데이터 넣기... np.nan
'''
df1['phone'] = np.nan
df1

     name   addr  age  phone
0   James     NY   33    NaN
1   Peter     NY   44    NaN
2   Tomas     LA   55    NaN
3  Robert  TEXAS   66    NaN

### DataFrame 조회 [인덱싱, 슬라이싱]

In [13]:
df2.columns=['one','two','three','four']
df2.index=list('abcd')
df2

   one  two  three  four
a   54   57     74    77
b   77   19     93    31
c   46   97     80    98
d   98   22     68    75

In [14]:
# 행검색 : 상위 두 줄 가져오기
df2[:2] # 인덱싱
df2['a':'b'] # 라벨... 뒷부분 포함됨

df2['one':'three'] # 이 방법으로는 컬럼 조회 안 됨

Empty DataFrame
Columns: [one, two, three, four]
Index: []

In [15]:
# 컬럼명 조회
# 2차원 구조라는 거 생각
df2[['one','three']]

# two 컬럼에 해당하는 값 중에서 45보다 큰 값만 추출
df2[df2['two']>=45] # 이 방법은 다른 컬럼 나옴

   one  two  three  four
a   54   57     74    77
c   46   97     80    98

## 색인 방법
#### loc, iloc
#### at, iat

In [16]:
'''
loc iloc
::
loc : 라벨 -- 뒷부분 포함
iloc : 인덱스 -- 뒷부분 미포함
'''
df1
print(df1.iloc[0:2,0:3])
print('*'*30)
print(df1.iloc[:2,:3])
print('*'*30)
print(df1.loc[:1,'name':'age']) 

print(df1.iloc[::-1])

    name addr  age
0  James   NY   33
1  Peter   NY   44
******************************
    name addr  age
0  James   NY   33
1  Peter   NY   44
******************************
    name addr  age
0  James   NY   33
1  Peter   NY   44
     name   addr  age  phone
3  Robert  TEXAS   66    NaN
2   Tomas     LA   55    NaN
1   Peter     NY   44    NaN
0   James     NY   33    NaN

In [17]:
# 스칼라값 가져오기
# loc, iloc는 스칼라값을 가져오는 용도는 아님

# 토마스가 살고 있는 곳 추출
print(df1)
print('토마스가 살고 있는 곳',df1.iat[2,1])

     name   addr  age  phone
0   James     NY   33    NaN
1   Peter     NY   44    NaN
2   Tomas     LA   55    NaN
3  Robert  TEXAS   66    NaN
토마스가 살고 있는 곳 LA

In [18]:
# 로버트의 나이
print(df1.iat[3,2])
print(df1.at[3,'age'])

# 수정
df1.at[3,'age']=68

66
66

In [19]:
# loc를 이용해 row 추가
df1.loc[4]=np.nan
df1

     name   addr   age  phone
0   James     NY  33.0    NaN
1   Peter     NY  44.0    NaN
2   Tomas     LA  55.0    NaN
3  Robert  TEXAS  68.0    NaN
4     NaN    NaN   NaN    NaN

## Data 삭제 : drop

In [20]:
'''
drop()
::
삭제한다
axis : 기준... 0=행(기본값) | 1=열

'''
# 누락데이터 삭제
#df1.drop(4)
#df1.drop('phone',axis=1, inplace=True)
#df1.drop(4, inplace=True)
df1

     name   addr   age  phone
0   James     NY  33.0    NaN
1   Peter     NY  44.0    NaN
2   Tomas     LA  55.0    NaN
3  Robert  TEXAS  68.0    NaN
4     NaN    NaN   NaN    NaN

## DataFrame 정렬하기

In [28]:
'''
index
axis : 행이냐 열이냐
ascending : 오름차순이냐 내림차순이냐

values
by 필수
[]로 여러 개 가능
'''
df2.sort_index()
df2.sort_index(axis=1, ascending=False)
df2.sort_values(by='one')

   one  two  three  four
c   46   97     80    98
a   54   57     74    77
b   77   19     93    31
d   98   22     68    75

In [77]:
# 단독으로 two열에 45보다 높은 값만 나오게 하기 
df2[df2['two']>45].iloc[:,1:2]

   two
a   57
c   97